MusicApp/app/controllers/bands_controller.rb

  def create
    @band = Band.new(band_params)
    if @band.save!
---
INSERT INTO "bands" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "Metallica"], ["created_at", "2019-02-01 00:49:55.167734"], ["updated_at", "2019-02-01 00:49:55.167734"]]